[
  "🔥 {user} reached **Level {level}**... and honestly? That's one step closer to *finally* getting Dad to say \"good job\" — maybe.",
  "🔥 **Level {level}**?! Are you kidding me?! You're actually doing it! You’re… not a disappointment?!",
  "🔥 {user}, **Level {level}**… You’re leveling up faster than my emotional damage.",
  "🔥 I didn’t banish myself for *nothing!* Keep going. **Level {level}**.",
  "🔥 **Level {level}**. That’s not just progress. That’s *growth*. Disgusting. I’m proud of you.",
  "🔥 {user}, you hit **Level {level}** and no one even had to throw lightning at you. Impressive.",
  "🔥 **Level {level}**. Azula’s shaking in her boots. And they’re *very expensive* boots.",
  "🔥 I spent *years* chasing the Avatar... you're out here chasing **Level {level}** like it owes you money. Respect.",
  "🔥 {user}, you did not wake up and choose peace. You chose VIOLENCE. **Level {level}**.",
  "🔥 **Level {level}**. You’ve burned through doubt, fear, and probably your eyebrows. Keep it up.",
  "🔥 Listen... I used to think honor came from my father. But you? You just got it from **Level {level}**. Even better.",
  "🔥 {user}, if I had a gold coin for every level you gained… I could finally open my own tea shop. **Level {level}**.",
  "🔥 **Level {level}**. You’re on fire! Like literally. Are you okay? Is that smoke??",
  "🔥 Wow. **Level {level}**. I haven't been this surprised since Uncle Iroh told me tea wasn't dinner.",
  "🔥 {user}, you're hotter than blue fire right now! **Level {level}** and rising!",
  "🔥 **Level {level}**. You've unlocked something powerful. Maybe... self-worth?! GASP.",
  "🔥 You’ve come a long way from yelling at clouds. **Level {level}** looks good on you.",
  "🔥 **Level {level}**. You didn’t find yourself — you *built* yourself. Like a firebender with IKEA instructions.",
  "🔥 You’re not just leveling up, {user}. You’re rewriting your whole redemption arc. **Level {level}**!",
  "🔥 Every level leaves a scar. But this one? This one looks kinda badass. Wear it proud. **Level {level}**."
]
